app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `name`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2012-05-04 02:39:23', 'filipebarcos@gmail.com', 'Filipe Costa', '83930bfb9b9ed0df2765ab6bd5026c46bb13599c', 'aefb110ff7708481c4ffbd7361a2c96703e10651', '2012-05-04 02:39:23')
---
  def create
    @user = User.new(params[:user])

    if @user.save